ГТС/УТГТС/Reports/ОтгрузкиОплатыМаркетинг.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Report>
		<Properties>
			<Name>ОтгрузкиОплатыМаркетинг</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>НачДата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонДата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Report>
</MetaDataObject>

ГТС/УТГТС/InformationRegisters/КурсыВалют.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>КурсыВалют</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Курс</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.КурсВалюты</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Кратность</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

ГТС/УТГТС/InformationRegisters/АналитикаУчетаНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>АналитикаУчетаНоменклатуры</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>КлючАналитики</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КлючиАналитикиУчетаНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Характеристика</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Серия</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СерииНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>МестоХранения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
						<v8:Type>cfg:CatalogRef.СтруктураПредприятия</v8:Type>
						<v8:Type>cfg:CatalogRef.Партнеры</v8:Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Назначение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Назначения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СтатьяКалькуляции</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатьиКалькуляции</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

ГТС/УТГТС/InformationRegisters/НоменклатураСегмента.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>НоменклатураСегмента</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>Сегмент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СегментыНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Характеристика</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

ГТС/УТГТС/InformationRegisters/АналитикаУчетаПоПартнерам.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>АналитикаУчетаПоПартнерам</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>КлючАналитики</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КлючиАналитикиУчетаПоПартнерам</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Партнер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Партнеры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Договор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыМеждуОрганизациями</v8:Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НаправлениеДеятельности</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НаправленияДеятельности</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

ГТС/УТГТС/AccumulationRegisters/РасчетыСКлиентами.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccumulationRegister>
		<Properties>
			<Name>РасчетыСКлиентами</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежнаяСуммаЛюбогоЗнака</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КОплате</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежнаяСуммаЛюбогоЗнака</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Оплачивается</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежнаяСуммаЛюбогоЗнака</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КОтгрузке</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежнаяСуммаЛюбогоЗнака</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Отгружается</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежнаяСуммаЛюбогоЗнака</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ХозяйственнаяОперация</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ХозяйственныеОперации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФормаОплаты</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ФормыОплаты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетНаОплату</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.СчетНаОплатуКлиенту</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПродажаПоЗаказу</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаявкаНаВозвратТоваровОтКлиента</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаказКлиента</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаРегистратора</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПлатежа</Name>
					<Comment>Заполняется для реализации товаров и услуг</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаРегл</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежнаяСуммаЛюбогоЗнака</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаУпр</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежнаяСуммаЛюбогоЗнака</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИсключатьПриКонтроле</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДопустимаяСуммаЗадолженности</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежнаяСуммаНеотрицательная</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗалогЗаТару</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежнаяСуммаЛюбогоЗнака</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатьяДвиженияДенежныхСредств</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатьиДвиженияДенежныхСредств</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РасчетныйДокумент</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.РасчетныйДокументСКлиентом</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПорядокОперации</Name>
					<Comment>Используется в распределении расчетов</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>40</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПорядокЗачетаПоДатеПлатежа</Name>
					<Comment>Используется в распределении расчетов</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>40</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СвязанныйДокумент</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.РасчетныйДокументСКлиентом</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВариантОплаты</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВариантыКонтроляОплатыКлиентом</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВалютаДокумента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КорОбъектРасчетов</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ОбъектыРасчетов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КорАналитикаУчетаПоПартнерам</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КлючиАналитикиУчетаПоПартнерам</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НастройкаХозяйственнойОперации</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НастройкиХозяйственныхОпераций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторФинЗаписи</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьКорОбъектРасчетов</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ОбъектРасчетов</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗаявкаНаРасходованиеДенежныхСредств</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаявкаНаРасходованиеДенежныхСредств</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбъектРасчетовПриемник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ОбъектыРасчетов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АналитикаУчетаПоПартнерамПриемник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КлючиАналитикиУчетаПоПартнерам</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВалютаПриемник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаПриемник</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежнаяСуммаЛюбогоЗнака</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПоДаннымОбъектаРасчетовИсточника</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сторно</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОперацияВзаиморасчетов</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ОперацииВзаиморасчетов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>АналитикаУчетаПоПартнерам</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КлючиАналитикиУчетаПоПартнерам</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ОбъектРасчетов</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ОбъектыРасчетов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Соглашение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СоглашенияСКлиентами</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>УдалитьЗаказКлиента</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ОбъектРасчетовСКлиентами</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

ГТС/УТГТС/Reports/ОтгрузкиОплатыМаркетинг/Forms/ФормаОтчета/Ext/Form/Module.bsl
///////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ НА СЕРВЕРЕ

&НаСервере
Процедура УдалитьПустыеЗначения(Список)
	ВсегоСтрок = Список.Количество();
	i = 0;
	Пока i < ВсегоСтрок Цикл
		ТекЭлемент = Список[i];
		Если НЕ ЗначениеЗаполнено(ТекЭлемент.Значение) Тогда
			Список.Удалить(ТекЭлемент);
			ВсегоСтрок = ВсегоСтрок - 1;
		Иначе
			i = i + 1;
		КонецЕсли;	
	КонецЦикла;	
КонецПроцедуры//УдалитьПустыеЗначения(Список)	

&НаСервере
Процедура ДобавитьВеткуВДеревоДанныхНаСервере(Выборка, СтрокиДанных)
	
	Уровень = Выборка.Уровень();
	ЭлементГруппировки = СЗ_Группировки.Получить(Уровень);
	ИмяГруппировки = ЭлементГруппировки.Значение;
	
	Если НомерГруппировкиДоРегиона = -1 И ВыводитьРегионы Тогда
		// добавляем все регионы
		Для каждого ЭлементРегион Из СЗ_Регионы Цикл
			СтрокаДанныхРегион = СтрокиДанных.Добавить();
			СтрокаДанныхРегион.Параметр = ЭлементРегион.Значение;
		КонецЦикла;
		НомерГруппировкиДоРегиона = -2;
	ИначеЕсли НомерГруппировкиДоРекламы = -1 И ВыводитьРекламу Тогда
		// добавляем все рекламы
		Для каждого СтрокаКанал Из ДЗ_Реклама.ПолучитьЭлементы() Цикл
			СтрокаДанныхКанал = СтрокиДанных.Добавить();
			СтрокаДанныхКанал.Параметр = СтрокаКанал.Параметр;	
			Для каждого СтрокаИсточник Из СтрокаКанал.ПолучитьЭлементы() Цикл
				СтрокаДанныхИсточник = СтрокаДанныхКанал.Строки.Добавить();
				СтрокаДанныхИсточник.Параметр = СтрокаИсточник.Параметр;
			КонецЦикла;
		КонецЦикла;
		НомерГруппировкиДоРекламы = -2;
	ИначеЕсли НомерГруппировкиДоСегмента = -1 И ВыводитьСегменты Тогда
		// добавляем все сегменты
		Для каждого ЭлементСегмент Из ТЗ_Сегменты Цикл
			СтрокаДанныхСегмент = СтрокиДанных.Добавить();
			СтрокаДанныхСегмент.Параметр = ЭлементСегмент.Значение;
		КонецЦикла;
		НомерГруппировкиДоСегмента = -2;
	КонецЕсли;
			
	Пока Выборка.Следующий() Цикл
		Параметр = Выборка[ИмяГруппировки];
		//Если Уровень = НомерГруппировкиСреднее Тогда
		//	ПредстПериода = Формат(Выборка.НачалоПериода, "ДФ=dd_MM_yyyy");
		//Иначе	
			ПредстПериода = Формат(Выборка.Период, "ДФ=dd_MM_yyyy");
		//КонецЕсли;
				
		//Если Уровень = НомерГруппировкиСреднее Тогда
		//	СтрокиДанных.Родитель["НачПериодаСумма_" + ПредстПериода] = Выборка.Сумма*КурсВалюты;
		//	СтрокиДанных.Родитель["НачПериодаКолвоКлиентов_" + ПредстПериода] = Выборка.Партнер;
		//	Родитель = СтрокиДанных.Родитель.Родитель;
		//	Пока Родитель <> Неопределено Цикл
		//		Родитель["НачПериодаСумма_" + ПредстПериода] = Родитель.Строки.Итог("НачПериодаСумма_" + ПредстПериода);
		//		Родитель["НачПериодаКолвоКлиентов_" + ПредстПериода] = Родитель.Строки.Итог("НачПериодаКолвоКлиентов_" + ПредстПериода);
		//		Родитель = Родитель.Родитель;
		//	КонецЦикла;	
		//	
		//	ВыборкаНиже = Выборка.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		//	ДобавитьВеткуВДеревоДанныхНаСервере(ВыборкаНиже, СтрокиДанных);
		//ИначеЕсли Уровень = НомерГруппировкиПериода Тогда
		Если Уровень = НомерГруппировкиПериода Тогда
			СтрокиДанных.Родитель["Сумма_" + ПредстПериода] = Выборка.Сумма*КурсВалюты;
			СтрокиДанных.Родитель["КолвоКлиентов_" + ПредстПериода] = Выборка.Партнер;
			Родитель = СтрокиДанных.Родитель.Родитель;
			Пока Родитель <> Неопределено Цикл
				Родитель["Сумма_" + ПредстПериода] = Родитель.Строки.Итог("Сумма_" + ПредстПериода);
				Родитель["КолвоКлиентов_" + ПредстПериода] = Родитель.Строки.Итог("КолвоКлиентов_" + ПредстПериода);
				Родитель = Родитель.Родитель;
			КонецЦикла;	
		Иначе	
			СтрокаДанные = СтрокиДанных.Найти(Параметр,"Параметр");
			Если СтрокаДанные = Неопределено Тогда
				СтрокаДанные = СтрокиДанных.Добавить();
			КонецЕсли;	
			СтрокаДанные.Параметр = Параметр;
			
			
			Если ВыводитьРегионы И Уровень = НомерГруппировкиДоРегиона Тогда
				// добавляем все регионы
				Для каждого ЭлементРегион Из СЗ_Регионы Цикл
					СтрокаДанныхРегион = СтрокаДанные.Строки.Добавить();
					СтрокаДанныхРегион.Параметр = ЭлементРегион.Значение;
				КонецЦикла;
			ИначеЕсли ВыводитьРекламу И Уровень = НомерГруппировкиДоРекламы Тогда
				// добавляем все рекламы
				Для каждого СтрокаКанал Из ДЗ_Реклама.ПолучитьЭлементы() Цикл
					СтрокаДанныхКанал = СтрокаДанные.Строки.Добавить();
					СтрокаДанныхКанал.Параметр = СтрокаКанал.Параметр;
					Для каждого СтрокаИсточник Из СтрокаКанал.ПолучитьЭлементы() Цикл
						СтрокаДанныхИсточник = СтрокаДанныхКанал.Строки.Добавить();
						СтрокаДанныхИсточник.Параметр = СтрокаИсточник.Параметр;
					КонецЦикла;	
				КонецЦикла;
			ИначеЕсли ВыводитьСегменты И Уровень = НомерГруппировкиДоСегмента Тогда
				// добавляем все сегменты
				Массив_Сегменты = ТЗ_Сегменты.НайтиСтроки(Новый Структура("Подразделение",Выборка.Подразделение));
				Для каждого СтрокаСегмент Из Массив_Сегменты Цикл
					СтрокаДанныхСегмент = СтрокаДанные.Строки.Добавить();
					СтрокаДанныхСегмент.Параметр = СтрокаСегмент.Сегмент;
				КонецЦикла;
				
			КонецЕсли;	
		
			ВыборкаНиже = Выборка.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
			Если ВыборкаНиже.Количество() > 0 Тогда
				ДобавитьВеткуВДеревоДанныхНаСервере(ВыборкаНиже, СтрокаДанные.Строки);
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	Если Уровень = СЗ_Группировки.Количество() + 1 И ВыводитьСегменты Тогда
		// надо распределить по сумме оплат
		
		Для каждого ЭлементСписка Из СЗ_СуммируемыеПоляПриЗаполнении Цикл
			Сумма = СтрокиДанных.Родитель[ЭлементСписка.Значение];
			
			СуммаВсего = СтрокиДанных.Итог(ЭлементСписка.Значение);
			
			Если СуммаВсего > Сумма Тогда
				Для каждого СтрокаСегмент из СтрокиДанных Цикл
					СуммаСегментаВсего = СтрокаСегмент[ЭлементСписка.Значение];
					СтрокаСегмент[ЭлементСписка.Значение] = Сумма * СтрокаСегмент[ЭлементСписка.Значение] / СуммаВсего;
					Для каждого СтрокаНоменклатура Из СтрокаСегмент.Строки Цикл
						СтрокаНоменклатура[ЭлементСписка.Значение] = СтрокаСегмент[ЭлементСписка.Значение] * СтрокаНоменклатура[ЭлементСписка.Значение] / СуммаСегментаВсего;
					КонецЦикла;	
				КонецЦикла;
			КонецЕсли;	
			
		КонецЦикла;
	КонецЕсли;

КонецПроцедуры//ДобавитьВеткуВДеревоДанныхНаСервере(Выборка, СтрокиДанных);

&НаСервере
Процедура ВывестиВТабличныйДокументНаСервере(ВыводимыеСтроки, Колонки, Уровень, СуммаИтого)
	
	ОтчетОбъект = РеквизитФормыВЗначение("Отчет");
	Макет = ОтчетОбъект.ПолучитьМакет("Макет");
	
	ОблГ_Параметр = Макет.ПолучитьОбласть("Группировка" + Уровень + "|Параметр");
	ОблГ_Период = Макет.ПолучитьОбласть("Группировка" + Уровень + "|Период");
	ОблГ_Среднее = Макет.ПолучитьОбласть("Группировка" + Уровень + "|СреднееЗаПериод");
	ОблГ_Всего = Макет.ПолучитьОбласть("Группировка" + Уровень + "|ВсегоЗаПериод");
	
	Для каждого СтрокаТЧ из ВыводимыеСтроки Цикл
		Если СтрокаТЧ.Параметр = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		КолвоПериодов = 0;
		КолвоЗаПериод = 0;
		ПериодовВсего = 0;
		
		
		// не выводим итогов по каналам
		ЭтоКанал = ТипЗнч(СтрокаТЧ.Параметр) = Тип("ПланВидовХарактеристикСсылка.КаналыРекламныхВоздействий") ИЛИ СтрокаТЧ.Параметр = "<<канал не указан>>";
		
		СуммаЗаПериод = 0;
		КолвоВсего = 0;
		СуммаВсего = 0;
		Для каждого Колонка Из Колонки Цикл
			Если Колонка.Имя = "Параметр" Тогда
				ОблГ_Параметр.Параметры.Группировка = СтрокаТЧ.Параметр;
				Область = ТабличныйДокумент.Вывести(ОблГ_Параметр, Уровень);
				Область.АвтоОтступ = Уровень;
			ИначеЕсли Найти(Колонка.Имя,"НачПериодаСумма") > 0 Тогда
				
				Если ЭтоКанал Тогда
					СуммаЗаПериод = 0;
				КонецЕсли;	
				//ОблГ_Среднее.Параметры.Колво = Колво;
				ОблГ_Среднее.Параметры.Среднее = Окр(СуммаЗаПериод / КолвоПериодов, 2);
				ТабличныйДокумент.Присоединить(ОблГ_Среднее);
				КолвоПериодов = 0;
				СуммаЗаПериод = 0;
			ИначеЕсли Найти(Колонка.Имя,"Сумма") > 0 Тогда
				Сумма = 0;
				Если ЭтоКанал Тогда
				ИначеЕсли СтрокаТЧ[Колонка.Имя] <> Неопределено Тогда
					Сумма = Окр(СтрокаТЧ[Колонка.Имя], 2);
				КонецЕсли;	
				ОблГ_Период.Параметры.Сумма = Сумма;
				ТабличныйДокумент.Присоединить(ОблГ_Период);
				КолвоПериодов = КолвоПериодов + 1;
				ПериодовВсего = ПериодовВсего + 1;
				СуммаЗаПериод = СуммаЗаПериод + Сумма;
				СуммаВсего = СуммаВсего + Сумма;
			ИначеЕсли Найти(Колонка.Имя,"Колво") > 0 И Найти(Колонка.Имя,"НачПериода") = 0 Тогда
				Колво = 0;
				Если ЭтоКанал Тогда
				ИначеЕсли СтрокаТЧ[Колонка.Имя] <> Неопределено Тогда
					Колво = СтрокаТЧ[Колонка.Имя];
				КонецЕсли;	
				КолвоВсего = КолвоВсего + Колво;	
			КонецЕсли;	
		КонецЦикла;
		
		Если ЭтоКанал Тогда
		ИначеЕсли СтрокаТЧ[Колонка.Имя] <> Неопределено Тогда
			ОблГ_Всего.Параметры.Колво = КолвоВсего;
			ОблГ_Всего.Параметры.Сумма = СуммаВсего;
			ОблГ_Всего.Параметры.Среднее = Окр(СуммаВсего / ПериодовВсего,2);
		 	ОблГ_Всего.Параметры.Процент = Окр(100 * СуммаВсего / СуммаИтого, 2);
		КонецЕсли;
				
		ТабличныйДокумент.Присоединить(ОблГ_Всего);
		Если СтрокаТЧ.Строки.Количество() > 0 Тогда
			ВывестиВТабличныйДокументНаСервере(СтрокаТЧ.Строки, Колонки, Уровень + 1, СуммаИтого);
		КонецЕсли;	
	КонецЦикла;
	
КонецПроцедуры//ВывестиВТабличныйДокументНаСервере

&НаСервере
Процедура СформироватьНаСервере()
	
	//Если НЕ ЗначениеЗаполнено(Календарь) Тогда
	//	Сообщение = Новый СообщениеПользователю;
	//	Сообщение.Поле = "Календарь";
	//	Сообщение.Текст = "Укажите календарь!";
	//	Сообщение.Сообщить();
	//	Возврат;
	//КонецЕсли;	
	
	//ЗапросКалендарь = Новый Запрос;
	//ЗапросКалендарь.Текст =
	//"ВЫБРАТЬ
	//|	КалендарныеГрафики.ДатаГрафика
	//|ИЗ
	//|	РегистрСведений.КалендарныеГрафики КАК КалендарныеГрафики
	//|ГДЕ
	//|	КалендарныеГрафики.ДеньВключенВГрафик
	//|	И КалендарныеГрафики.ДатаГрафика МЕЖДУ &НачДата И &КонДата
	//|	И КалендарныеГрафики.Календарь = &Календарь";
	//ЗапросКалендарь.УстановитьПараметр("НачДата", НачДата);
	//ЗапросКалендарь.УстановитьПараметр("КонДата", КонецДня(КонДата));
	//ЗапросКалендарь.УстановитьПараметр("Календарь", Календарь);
	//
	//ВыборкаДни = ЗапросКалендарь.Выполнить().Выбрать();
	//Если ВыборкаДни.Количество() = 0 Тогда
	//	Сообщение = Новый СообщениеПользователю;
	//	Сообщение.Поле = "Календарь";
	//	Сообщение.Текст = "В календаре не найдено рабочих дней за выбранный период!";
	//	Сообщение.Сообщить();
	//	Возврат;
	//КонецЕсли;	
		
	КурсВалюты = 1;
	Если Валюта <> Константы.ВалютаРегламентированногоУчета.Получить() Тогда
		КурсыПоследнее = РегистрыСведений.КурсыВалют.ПолучитьПоследнее(КонДата, Новый Структура("Валюта", Валюта));	
		КурсВалюты = КурсыПоследнее.Кратность / ?(КурсыПоследнее.Курс = 0, 1, КурсыПоследнее.Курс);
	КонецЕсли;
	
	Попытка
		МассивСтроки = Группировки.НайтиСтроки(Новый Структура("Имя", "Сегменты"));
		ВыводитьСегменты = МассивСтроки[0].Пометка;	
	Исключение
		ВыводитьСегменты = Ложь;
	КонецПопытки;
	
	УдалитьПустыеЗначения(ОтборПодразделения);
	УдалитьПустыеЗначения(ОтборМенеджеры);
	УдалитьПустыеЗначения(ОтборПартнеры);
	УдалитьПустыеЗначения(ОтборСегменты);
	УдалитьПустыеЗначения(ОтборНоменклатура);
	
	Если ВыводитьСегменты Тогда
		ТЗ_Сегменты.Очистить();
		
		ЗапросСегменты = Новый Запрос;
		ТекстУсловия = "";
		
		ДобавлятьПустой = Ложь;
		Если ВидОтбораСегменты = "ВСписке" Тогда
			ТекстУсловия = " И СегментыНоменклатуры.Ссылка В Иерархии(&Сегменты)";
			ЗапросСегменты.УстановитьПараметр("Сегменты", ОтборСегменты);
		ИначеЕсли ВидОтбораСегменты = "НеВСписке" Тогда
			ТекстУсловия = " И (НЕ СегментыНоменклатуры.Ссылка В Иерархии(&Сегменты))";
			ЗапросСегменты.УстановитьПараметр("Сегменты", ОтборСегменты);
		Иначе
			ДобавлятьПустой = Истина;
		КонецЕсли;
		
		Запрос = Новый Запрос;
		Запрос.Текст =
		"ВЫБРАТЬ
		|	СегментыНоменклатуры.Ссылка КАК Сегмент
		|ИЗ
		|	Справочник.СегментыНоменклатуры КАК СегментыНоменклатуры
		|ГДЕ
		|	(НЕ СегментыНоменклатуры.ПометкаУдаления)
		|	И (НЕ СегментыНоменклатуры.ЭтоГруппа)
		|	И СегментыНоменклатуры.Подразделение = &Подразделение " + ТекстУсловия;
		Запрос.УстановитьПараметр("Подразделение", Справочники.СтруктураПредприятия.ПустаяСсылка());
		
		ВыборкаОбщСегменты = Запрос.Выполнить().Выбрать();

		ЗапросСегменты.Текст =
		"ВЫБРАТЬ
		|	СегментыНоменклатуры.Ссылка КАК Сегмент,
		|	СтруктураПредприятия.Ссылка КАК Подразделение
		|ИЗ
		|	Справочник.СтруктураПредприятия КАК СтруктураПредприятия
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.СегментыНоменклатуры КАК СегментыНоменклатуры
		|		ПО (СегментыНоменклатуры.Подразделение = СтруктураПредприятия.Ссылка
		|				И (НЕ СегментыНоменклатуры.ПометкаУдаления)
		|				И (НЕ СегментыНоменклатуры.ЭтоГруппа)  " + ТекстУсловия  + ")
		|ГДЕ
		|	(НЕ СтруктураПредприятия.ПометкаУдаления)
		|
		|УПОРЯДОЧИТЬ ПО
		|	Сегмент
		|АВТОУПОРЯДОЧИВАНИЕ";
		
		Подр = Неопределено;
		Выборка = ЗапросСегменты.Выполнить().Выбрать();
		Пока Выборка.Следующий() Цикл
			
			Если Выборка.Сегмент = Null Тогда
				Продолжить;
			КонецЕсли;
			
			СтрокаСегмент = ТЗ_Сегменты.Добавить();
			ЗаполнитьЗначенияСвойств(СтрокаСегмент, Выборка);
			
			//Если Подр <> Выборка.Подразделение И ДобавлятьПустой Тогда
			//	СтрокаСегмент = ТЗ_Сегменты.Добавить();
			//	СтрокаСегмент.Сегмент = "<<вне сегмента>>";
			//	СтрокаСегмент.Подразделение = Выборка.Подразделение;
			//	ВыборкаОбщСегменты.Сбросить();
			//	Пока ВыборкаОбщСегменты.Следующий() Цикл
			//		СтрокаСегмент = ТЗ_Сегменты.Добавить();
			//		СтрокаСегмент.Сегмент = ВыборкаОбщСегменты.Сегмент;
			//		СтрокаСегмент.Подразделение = Выборка.Подразделение;
			//	КонецЦикла;
			//КонецЕсли;
			//Подр = Выборка.Подразделение;
		КонецЦикла;	
	КонецЕсли;
	
	МассивСтроки = Группировки.НайтиСтроки(Новый Структура("Имя", "Реклама"));
	ВыводитьРекламу = МассивСтроки[0].Пометка;	
	Если ВыводитьРекламу Тогда
		// соберем все маркетинговые мероприятия
		ДЗ_Реклама.ПолучитьЭлементы().Очистить();
		
		СтрокаКанал = ДЗ_Реклама.ПолучитьЭлементы().Добавить();
		СтрокаКанал.Параметр = "<<канал не указан>>";
		
		СтрокаИсточник = СтрокаКанал.ПолучитьЭлементы().Добавить();
		СтрокаИсточник.Параметр = "<<источник не указан>>";
		
		ЗапросРеклама = Новый Запрос;
		ЗапросРеклама.Текст =
		"ВЫБРАТЬ
		|	МаркетинговыеМероприятия.Ссылка КАК Источник,
		|	МаркетинговыеМероприятия.Владелец КАК Канал
		|ИЗ
		|	Справочник.МаркетинговыеМероприятия КАК МаркетинговыеМероприятия
		|ГДЕ
		|	(НЕ МаркетинговыеМероприятия.ПометкаУдаления)
		|
		|УПОРЯДОЧИТЬ ПО
		|	Канал,
		|	МаркетинговыеМероприятия.Код
		|ИТОГИ ПО
		|	Канал,
		|	Источник";
		ВыборкаКанал = ЗапросРеклама.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		Пока ВыборкаКанал.Следующий() Цикл
			СтрокаКанал = ДЗ_Реклама.ПолучитьЭлементы().Добавить();
			СтрокаКанал.Параметр = ВыборкаКанал.Канал;
			ВыборкаИсточник = ВыборкаКанал.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
			Пока ВыборкаИсточник.Следующий() Цикл
				СтрокаИсточник = СтрокаКанал.ПолучитьЭлементы().Добавить();
				СтрокаИсточник.Параметр = ВыборкаИсточник.Источник;
			КонецЦикла;	
		КонецЦикла;
	КонецЕсли;

	МассивСтроки = Группировки.НайтиСтроки(Новый Структура("Имя", "БизнесРегион"));
	ВыводитьРегионы = МассивСтроки[0].Пометка;	
	Если ВыводитьРегионы Тогда
		// соберем все регионы
		СЗ_Регионы.Очистить();
		
		СЗ_Регионы.Добавить("<<регион не указан>>");
		
		ЗапросРегионы = Новый Запрос;
		ЗапросРегионы.Текст =
		"ВЫБРАТЬ
		|	БизнесРегионы.Ссылка КАК Регион
		|ИЗ
		|	Справочник.БизнесРегионы КАК БизнесРегионы
		|ГДЕ
		|	(НЕ БизнесРегионы.ПометкаУдаления)
		|
		|УПОРЯДОЧИТЬ ПО
		|	БизнесРегионы.Наименование";
		ВыборкаРегион = ЗапросРегионы.Выполнить().Выбрать();
		Пока ВыборкаРегион.Следующий() Цикл
			СЗ_Регионы.Добавить(ВыборкаРегион.Регион);
		КонецЦикла;	
	КонецЕсли;
	
	ДеревоДанных = Новый ДеревоЗначений;
	ДеревоДанных.Колонки.Добавить("Параметр");
	
	СЗ_СуммируемыеПоляПриЗаполнении.Очистить();
	
	Массив = Новый Массив;
	Массив.Добавить(Тип("Число"));
	ОписаниеЧисло = Новый ОписаниеТипов(Массив);
	
	Если Периодичность = "ПоДням" Тогда
		//КонДата = КонецНедели(КонДата);
	ИначеЕсли Периодичность = "ПоНеделям" Тогда
		НачДата = НачалоНедели(НачДата);
		КонДата = КонецНедели(КонДата);
	ИначеЕсли Периодичность = "ПоМесяцам" Тогда
		НачДата = НачалоМесяца(НачДата);
		КонДата = КонецМесяца(КонДата);
	КонецЕсли;
	
	ДеревоДанных = Новый ДеревоЗначений;
	ДеревоДанных.Колонки.Добавить("Параметр");
	
	ТекДень = НачДата;
	КолвоПериодов = 0;
	Пока ТекДень <= КонДата Цикл
		Если Периодичность = "ПоДням" Тогда
			
			ДеревоДанных.Колонки.Добавить("Сумма_" + Формат(ТекДень, "ДФ=dd_MM_yyyy"), ОписаниеЧисло);
			ДеревоДанных.Колонки.Добавить("КолвоКлиентов_" + Формат(ТекДень, "ДФ=dd_MM_yyyy"), ОписаниеЧисло);
			
			Если ДеньНедели(ТекДень) = 7 ИЛИ ТекДень = КонДата Тогда
				ДеревоДанных.Колонки.Добавить("НачПериодаСумма_" + Формат(НачалоНедели(ТекДень), "ДФ=dd_MM_yyyy"), ОписаниеЧисло);
				ДеревоДанных.Колонки.Добавить("НачПериодаКолвоКлиентов_" + Формат(НачалоНедели(ТекДень), "ДФ=dd_MM_yyyy"), ОписаниеЧисло);
			КонецЕсли;	
			ТекДень = НачалоДня(ТекДень + 24 * 60 * 60);
		ИначеЕсли Периодичность = "ПоНеделям" Тогда
			
			ДеревоДанных.Колонки.Добавить("Сумма_" + Формат(НачалоНедели(ТекДень), "ДФ=dd_MM_yyyy"), ОписаниеЧисло);
			ДеревоДанных.Колонки.Добавить("КолвоКлиентов_" + Формат(НачалоНедели(ТекДень), "ДФ=dd_MM_yyyy"), ОписаниеЧисло);
			
			Если КонецНедели(ТекДень) >= КонецМесяца(Макс(НачалоНедели(ТекДень),НачДата)) ИЛИ КонецНедели(ТекДень) = КонецНедели(КонДата) Тогда
				ДеревоДанных.Колонки.Добавить("НачПериодаСумма_" + Формат(НачалоМесяца(Макс(НачалоНедели(ТекДень),НачДата)), "ДФ=dd_MM_yyyy"), ОписаниеЧисло);
				ДеревоДанных.Колонки.Добавить("НачПериодаКолвоКлиентов_" + Формат(НачалоМесяца(Макс(НачалоНедели(ТекДень),НачДата)), "ДФ=dd_MM_yyyy"), ОписаниеЧисло);
			КонецЕсли;
			
			ТекДень = НачалоНедели(ТекДень + 7 * 24 * 60 * 60);
			
		ИначеЕсли Периодичность = "ПоМесяцам" Тогда
			
			ДеревоДанных.Колонки.Добавить("Сумма_" + Формат(НачалоМесяца(ТекДень), "ДФ=dd_MM_yyyy"), ОписаниеЧисло);
			ДеревоДанных.Колонки.Добавить("КолвоКлиентов_" + Формат(НачалоМесяца(ТекДень), "ДФ=dd_MM_yyyy"), ОписаниеЧисло);
			
			Если КонецМесяца(ТекДень) >= КонецГода(Макс(НачалоМесяца(ТекДень),НачДата)) ИЛИ КонецМесяца(ТекДень) = КонецМесяца(КонДата) Тогда
				ДеревоДанных.Колонки.Добавить("НачПериодаСумма_" + Формат(НачалоГода(Макс(НачалоМесяца(ТекДень),НачДата)), "ДФ=dd_MM_yyyy"), ОписаниеЧисло);
				ДеревоДанных.Колонки.Добавить("НачПериодаКолвоКлиентов_" + Формат(НачалоГода(Макс(НачалоМесяца(ТекДень),НачДата)), "ДФ=dd_MM_yyyy"), ОписаниеЧисло);
			КонецЕсли;
			
			ТекДень = НачалоМесяца(ТекДень + 31 * 24 * 60 * 60);
		КонецЕсли;
		
	КонецЦикла;	
	
	Для каждого Колонка из ДеревоДанных.Колонки Цикл
		Если Колонка.Имя = "Параметр" Тогда
			Продолжить;
		КонецЕсли;	
		СЗ_СуммируемыеПоляПриЗаполнении.Добавить(Колонка.Имя);
	КонецЦикла;
	
	//ДеревоДанных.Колонки.Добавить("СуммаИтого", ОписаниеЧисло);
	
	СтрокаИтого = ДеревоДанных.Строки.Добавить();
	
	
	НомерГруппировкиДоРегиона = -1;
	НомерГруппировкиДоРекламы = -1;
	НомерГруппировкиДоСегмента = -1;
	НомерГруппировкиПериода = -1;
	
	ТекстВыбрать = "";
	ТекстИтоги = "";
	
	ТекстГруппировки = "";
	
	СЗ_Группировки.Очистить();
	Для каждого ЭлементГруппировки Из Группировки Цикл
		Если ЭлементГруппировки.Пометка Тогда
			
			ТекстГруппировки = ТекстГруппировки + ?(ПустаяСтрока(ТекстГруппировки),"","
							| ") + ЭлементГруппировки.Представление;
			
			Если Показатель = "Отгрузка" И ЭлементГруппировки.Имя = "Сегменты" Тогда
				
				ТекстВыбрать = ТекстВыбрать + Символы.ПС + ЭлементГруппировки.ПутьОтгрузки;
				
				ТекстИтоги = ТекстИтоги + ?(ПустаяСтрока(ТекстИтоги),"",",") + "
						| Сегмент,
						| Номенклатура";		
						
				НомерГруппировкиДоСегмента = СЗ_Группировки.Количество() - 1;
				
				СЗ_Группировки.Добавить("Сегмент");
				СЗ_Группировки.Добавить("Номенклатура");
				
				Продолжить;
			КонецЕсли;
			
			
			Если ЭлементГруппировки.Имя = "Реклама" Тогда
				НомерГруппировкиДоРекламы = СЗ_Группировки.Количество() - 1;
				
				Если Показатель = "Отгрузка" Тогда
					ТекстВыбрать = ТекстВыбрать + "
					|	Выбор 
					|		Когда ВыручкаИСебестоимостьПродажОбороты.ЗаказКлиента.КаналПервичногоИнтереса = Значение(ПланВидовХарактеристик.КаналыРекламныхВоздействий.ПустаяСсылка) 
					|				ИЛИ ВыручкаИСебестоимостьПродажОбороты.ЗаказКлиента.КаналПервичногоИнтереса Есть Null 
					|			Тогда ""<<канал не указан>>"" 
					|		Иначе ВыручкаИСебестоимостьПродажОбороты.ЗаказКлиента.КаналПервичногоИнтереса 
					|	Конец КАК Канал,
					|	Выбор 
					|		Когда ВыручкаИСебестоимостьПродажОбороты.ЗаказКлиента.ИсточникПервичногоИнтереса = Неопределено 
					|			ИЛИ ВыручкаИСебестоимостьПродажОбороты.ЗаказКлиента.ИсточникПервичногоИнтереса Есть Null 
					|		Тогда ""<<источник не указан>>"" 
					|	Иначе Выразить(ВыручкаИСебестоимостьПродажОбороты.ЗаказКлиента.ИсточникПервичногоИнтереса КАК Справочник.МаркетинговыеМероприятия)
					|	Конец КАК Источник,";
					
				Иначе// Оплата	
					
					ТекстВыбрать = ТекстВыбрать + "
					|	ВЫБОР
					|		КОГДА ЕСТЬNULL(ВЫРАЗИТЬ(ОбъектыРасчетов.Объект КАК Документ.ЗаказКлиента).КаналПервичногоИнтереса, ЗНАЧЕНИЕ(ПланВидовХарактеристик.КаналыРекламныхВоздействий.ПустаяСсылка)) = ЗНАЧЕНИЕ(ПланВидовХарактеристик.КаналыРекламныхВоздействий.ПустаяСсылка)
					|			ТОГДА ""<<канал не указан>>""
					|		ИНАЧЕ ВЫРАЗИТЬ(ОбъектыРасчетов.Объект КАК Документ.ЗаказКлиента).КаналПервичногоИнтереса
					|	КОНЕЦ КАК Канал,
					|	ВЫБОР
					|		КОГДА ВЫРАЗИТЬ(ОбъектыРасчетов.Объект КАК Документ.ЗаказКлиента).ИсточникПервичногоИнтереса ЕСТЬ NULL
					|			ТОГДА ""<<источник не указан>>""
					|		ИНАЧЕ Выразить(ВЫРАЗИТЬ(ОбъектыРасчетов.Объект КАК Документ.ЗаказКлиента).ИсточникПервичногоИнтереса КАК Справочник.МаркетинговыеМероприятия)
					|	КОНЕЦ КАК Источник,";

				КонецЕсли;
				СЗ_Группировки.Добавить("Канал");
				СЗ_Группировки.Добавить("Источник");
				
				ТекстИтоги = ТекстИтоги + ?(ПустаяСтрока(ТекстИтоги),"",",") + "
						| Канал,
						| Источник";
				Продолжить;
			ИначеЕсли ЭлементГруппировки.Имя = "БизнесРегион" Тогда
				НомерГруппировкиДоРегиона = СЗ_Группировки.Количество() - 1; 	
			КонецЕсли;
			ТекстВыбрать = ТекстВыбрать + ?(Показатель = "Отгрузка","
						| " + ЭлементГруппировки.ПутьОтгрузки,"
						| " + ЭлементГруппировки.ПутьОплаты); 			
						
			ТекстИтоги = ТекстИтоги + ?(ПустаяСтрока(ТекстИтоги),"",",") + "
						| " + ЭлементГруппировки.Имя;
			СЗ_Группировки.Добавить(ЭлементГруппировки.Имя);
		КонецЕсли;	
	КонецЦикла;
	//НомерГруппировкиСреднее = СЗ_Группировки.Количество();
	НомерГруппировкиПериода = СЗ_Группировки.Количество();
	//СЗ_Группировки.Добавить("НачалоПериода");
	СЗ_Группировки.Добавить("Период");
	СЗ_Группировки.Добавить("ЗаказКлиента");
	
	ТекстСоединениеСегменты = "";
	
	Если Показатель = "Отгрузка" Тогда
		//ТекстПериода = "НАЧАЛОПЕРИОДА(ВыручкаИСебестоимостьПродажОбороты.Период, НЕДЕЛЯ) КАК НачалоПериода,
		ТекстПериода = "	НАЧАЛОПЕРИОДА(ВыручкаИСебестоимостьПродажОбороты.Период, День) КАК Период,";
		Если Периодичность = "ПоНеделям" Тогда
			//ТекстПериода = "НАЧАЛОПЕРИОДА(ВыручкаИСебестоимостьПродажОбороты.Период, МЕСЯЦ) КАК НачалоПериода,
			ТекстПериода = "	НАЧАЛОПЕРИОДА(ВыручкаИСебестоимостьПродажОбороты.Период, НЕДЕЛЯ) КАК Период,";
		ИначеЕсли Периодичность = "ПоМесяцам" Тогда
			//ТекстПериода = "НАЧАЛОПЕРИОДА(ВыручкаИСебестоимостьПродажОбороты.Период, ГОД) КАК НачалоПериода,
			ТекстПериода = "	НАЧАЛОПЕРИОДА(ВыручкаИСебестоимостьПродажОбороты.Период, МЕСЯЦ) КАК Период,";
		КонецЕсли;
		
		ТекстСоединениеСегменты = "
		|ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.АналитикаУчетаНоменклатуры КАК РСв_АналитикаУчетаНоменклатуры
		|	ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.НоменклатураСегмента КАК НоменклатураСегмента
		|	ПО РСв_АналитикаУчетаНоменклатуры.Характеристика = НоменклатураСегмента.Характеристика
		|		И РСв_АналитикаУчетаНоменклатуры.Номенклатура = НоменклатураСегмента.Номенклатура
		|ПО ВыручкаИСебестоимостьПродажОбороты.АналитикаУчетаНоменклатуры = РСв_АналитикаУчетаНоменклатуры.КлючАналитики";
	Иначе
		//ТекстПериода = "НАЧАЛОПЕРИОДА(РасчетыСКлиентами.Период, НЕДЕЛЯ) КАК НачалоПериода,
		ТекстПериода = "	НАЧАЛОПЕРИОДА(РасчетыСКлиентами.Период, День) КАК Период,";
		Если Периодичность = "ПоНеделям" Тогда
			//ТекстПериода = "НАЧАЛОПЕРИОДА(РасчетыСКлиентами.Период, Месяц) КАК НачалоПериода,
			ТекстПериода = "	НАЧАЛОПЕРИОДА(РасчетыСКлиентами.Период, Неделя) КАК Период,";
		ИначеЕсли Периодичность = "ПоМесяцам" Тогда
			//ТекстПериода = "НАЧАЛОПЕРИОДА(РасчетыСКлиентами.Период, Год) КАК НачалоПериода,
			ТекстПериода = "	НАЧАЛОПЕРИОДА(РасчетыСКлиентами.Период, Месяц) КАК Период,";
		КонецЕсли;
		
	КонецЕсли;	
	
	ТекстВыбрать = ТекстВыбрать + "
						| " + ТекстПериода;
						
	ТекстГруппировки = ТекстИтоги;					
	ТекстИтоги = ТекстИтоги + ?(ПустаяСтрока(ТекстИтоги),"",",") + "
				//| НачалоПериода,
				| Период,
				| ЗаказКлиента";
	Запрос = Новый Запрос;
	ТекстУсловия = "";
	
	
	УсловиеПоНоменклатуреПартнерам = "";
	
	ТекстСоединениеПартнеры = "";
	
	Если ВидОтбораПартнеры = "ВСписке" Тогда
		УсловиеПоНоменклатуреПартнерам = УсловиеПоНоменклатуреПартнерам  + ?(ЗначениеЗаполнено(УсловиеПоНоменклатуреПартнерам), " И ", "ГДЕ ") + " РСв_АналитикаУчетаПоПартнерам.Партнер В(&СписокПартнеров)";
		Запрос.УстановитьПараметр("СписокПартнеров", ОтборПартнеры);
	ИначеЕсли ВидОтбораПартнеры = "НеВСписке" Тогда
		УсловиеПоНоменклатуреПартнерам = УсловиеПоНоменклатуреПартнерам  + ?(ЗначениеЗаполнено(УсловиеПоНоменклатуреПартнерам), " И ", "ГДЕ ") + " (НЕ РСв_АналитикаУчетаПоПартнерам.Партнер В(&СписокПартнеров))";
		Запрос.УстановитьПараметр("СписокПартнеров", ОтборПартнеры);
	КонецЕсли;
		
	Если Показатель = "Отгрузка" Тогда
		Если ВидОтбораПодразделения = "ВСписке" Тогда
			ТекстУсловия = ТекстУсловия  + ?(ЗначениеЗаполнено(ТекстУсловия), " И ", "") + " Подразделение В(&СписокПодразделений)";
			Запрос.УстановитьПараметр("СписокПодразделений", ОтборПодразделения);
		ИначеЕсли ВидОтбораПодразделения = "НеВСписке" Тогда
			ТекстУсловия = ТекстУсловия  + ?(ЗначениеЗаполнено(ТекстУсловия), " И ", "") + " (НЕ Подразделение В(&СписокПодразделений))";
			Запрос.УстановитьПараметр("СписокПодразделений", ОтборПодразделения);
		КонецЕсли;
		
		Если ВидОтбораНоменклатура = "ВСписке" Тогда
			УсловиеПоНоменклатуреПартнерам = УсловиеПоНоменклатуреПартнерам  + ?(ЗначениеЗаполнено(УсловиеПоНоменклатуреПартнерам), " И ", "ГДЕ ") + " РСв_АналитикаУчетаНоменклатуры.Номенклатура В Иерархии(&Номенклатура)";
			Запрос.УстановитьПараметр("Номенклатура", ОтборНоменклатура);
		ИначеЕсли ВидОтбораНоменклатура = "НеВСписке" Тогда
			УсловиеПоНоменклатуреПартнерам = УсловиеПоНоменклатуреПартнерам  + ?(ЗначениеЗаполнено(УсловиеПоНоменклатуреПартнерам), " И ", "ГДЕ ") + " (НЕ РСв_АналитикаУчетаНоменклатуры.Номенклатура В Иерархии(&Номенклатура))";
			Запрос.УстановитьПараметр("Номенклатура", ОтборНоменклатура);
		КонецЕсли;
		
		Если ВидОтбораСегменты = "ВСписке" Тогда
			УсловиеПоНоменклатуреПартнерам = УсловиеПоНоменклатуреПартнерам  + ?(ЗначениеЗаполнено(УсловиеПоНоменклатуреПартнерам), " И ", "ГДЕ ") + "НоменклатураСегмента.Сегмент В ИЕРАРХИИ(&Сегменты)";
			Запрос.УстановитьПараметр("Сегменты", ОтборСегменты);
		ИначеЕсли ВидОтбораСегменты = "НеВСписке" Тогда
			УсловиеПоНоменклатуреПартнерам = УсловиеПоНоменклатуреПартнерам  + ?(ЗначениеЗаполнено(УсловиеПоНоменклатуреПартнерам), " И ", "ГДЕ ") + "(НЕ НоменклатураСегмента.Сегмент В ИЕРАРХИИ(&Сегменты))";
			Запрос.УстановитьПараметр("Сегменты", ОтборСегменты);
		КонецЕсли;
		Если ВидОтбораМенеджеры = "ВСписке" Тогда
			УсловиеПоНоменклатуреПартнерам = УсловиеПоНоменклатуреПартнерам  + ?(ЗначениеЗаполнено(УсловиеПоНоменклатуреПартнерам), " И ", "ГДЕ ") + " ЕстьNull(ЗаказКлиента.Менеджер, РСв_АналитикаУчетаПоПартнерам.Партнер.ОсновнойМенеджер) В(&СписокМенеджеров)";
			Запрос.УстановитьПараметр("СписокМенеджеров", ОтборМенеджеры);
		ИначеЕсли ВидОтбораМенеджеры = "НеВСписке" Тогда
			УсловиеПоНоменклатуреПартнерам = УсловиеПоНоменклатуреПартнерам  + ?(ЗначениеЗаполнено(УсловиеПоНоменклатуреПартнерам), " И ", "ГДЕ ") + " (НЕ ЕстьNull(ЗаказКлиента.Менеджер, РСв_АналитикаУчетаПоПартнерам.Партнер.ОсновнойМенеджер) В(&СписокМенеджеров))";
			Запрос.УстановитьПараметр("СписокМенеджеров", ОтборМенеджеры);
		КонецЕсли;
	
		Иначе
		Если ВидОтбораПодразделения = "ВСписке" Тогда
			
			ТекстУсловия = ТекстУсловия  + ?(ЗначениеЗаполнено(ТекстУсловия), " И ", "") + " ЕстьNull(ОбъектыРасчетов.Подразделение, РСв_АналитикаУчетаПоПартнерам.Партнер.ОсновнойМенеджер.Подразделение) В(&СписокПодразделений)";
			Запрос.УстановитьПараметр("СписокПодразделений", ОтборПодразделения);
		ИначеЕсли ВидОтбораПодразделения = "НеВСписке" Тогда
			ТекстУсловия = ТекстУсловия  + ?(ЗначениеЗаполнено(ТекстУсловия), " И ", "") + " (НЕ ЕстьNull(ОбъектыРасчетов.Подразделение, РСв_АналитикаУчетаПоПартнерам.Партнер.ОсновнойМенеджер.Подразделение) В(&СписокПодразделений))";
			Запрос.УстановитьПараметр("СписокПодразделений", ОтборПодразделения);
		КонецЕсли;
		
		Если ВидОтбораМенеджеры = "ВСписке" Тогда
			ТекстУсловия = ТекстУсловия + ?(ЗначениеЗаполнено(ТекстУсловия), " И ", "") + " ЕстьNull(ОбъектыРасчетов.Менеджер, РСв_АналитикаУчетаПоПартнерам.Партнер.ОсновнойМенеджер) В(&СписокМенеджеров)";
			Запрос.УстановитьПараметр("СписокМенеджеров", ОтборМенеджеры);
		ИначеЕсли ВидОтбораМенеджеры = "НеВСписке" Тогда
			ТекстУсловия = ТекстУсловия  + ?(ЗначениеЗаполнено(ТекстУсловия), " И ", "") + " (НЕ ЕстьNull(ОбъектыРасчетов.Менеджер, РСв_АналитикаУчетаПоПартнерам.Партнер.ОсновнойМенеджер) В(&СписокМенеджеров))";
			Запрос.УстановитьПараметр("СписокМенеджеров", ОтборМенеджеры);
		КонецЕсли;
	КонецЕсли;
	
	Если Показатель = "Отгрузка" Тогда
		Запрос.Текст = "
		|ВЫБРАТЬ " + ТекстВыбрать + "
		|	ВыручкаИСебестоимостьПродажОбороты.ЗаказКлиента КАК ЗаказКлиента,
		|	ВыручкаИСебестоимостьПродажОбороты.СуммаВыручкиОборот КАК Сумма,
		|	РСв_АналитикаУчетаПоПартнерам.Партнер КАК Партнер
		|ИЗ
		|	РегистрНакопления.ВыручкаИСебестоимостьПродаж.Обороты(&НачДата, &КонДата, Регистратор, " + ТекстУсловия + ") КАК ВыручкаИСебестоимостьПродажОбороты
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Партнеры.ДополнительныеРеквизиты КАК ПартнерыДополнительныеРеквизиты
		|		ПО ВыручкаИСебестоимостьПродажОбороты.ЗаказКлиента.Партнер = ПартнерыДополнительныеРеквизиты.Ссылка
		|			И (ПартнерыДополнительныеРеквизиты.Свойство.Наименование ПОДОБНО ""Вид%деят%"")" + ТекстСоединениеСегменты + "
		|ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.АналитикаУчетаПоПартнерам КАК РСв_АналитикаУчетаПоПартнерам
		|ПО ВыручкаИСебестоимостьПродажОбороты.АналитикаУчетаПоПартнерам = РСв_АналитикаУчетаПоПартнерам.КлючАналитики
		|" + УсловиеПоНоменклатуреПартнерам + "
		| Упорядочить ПО" + "
		|" + ТекстГруппировки + "
		|ИТОГИ
		|	СУММА(Сумма),
		|	КОЛИЧЕСТВО(Различные Партнер)
		|ПО" + ТекстИтоги + "
		|АВТОУПОРЯДОЧИВАНИЕ";
	Иначе
		Запрос.Текст = "
		|ВЫБРАТЬ " + ТекстВыбрать + "	
		|	ОбъектыРасчетов.Объект КАК ЗаказКлиента,
		|	РасчетыСКлиентами.Сумма КАК Сумма,
		|	РСв_АналитикаУчетаПоПартнерам.Партнер КАК Партнер
		|ИЗ
		//|	РегистрНакопления.РасчетыСКлиентамиПоДокументам.Обороты(&НачДата, &КонДата, Регистратор, " + ТекстУсловия + ") КАК РасчетыСКлиентамиПоДокументамОбороты
		|	РегистрНакопления.РасчетыСКлиентами КАК РасчетыСКлиентами
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ОбъектыРасчетов КАК ОбъектыРасчетов
		|		ПО РасчетыСКлиентами.ОбъектРасчетов = ОбъектыРасчетов.Ссылка
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Партнеры.ДополнительныеРеквизиты КАК ПартнерыДополнительныеРеквизиты
		|		ПО ОбъектыРасчетов.Партнер = ПартнерыДополнительныеРеквизиты.Ссылка
		|			И (ПартнерыДополнительныеРеквизиты.Свойство.Наименование ПОДОБНО ""Вид%деят%"")
		|ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.АналитикаУчетаПоПартнерам КАК РСв_АналитикаУчетаПоПартнерам
		|ПО РасчетыСКлиентами.АналитикаУчетаПоПартнерам = РСв_АналитикаУчетаПоПартнерам.КлючАналитики
		| ГДЕ РасчетыСКлиентами.Период Между &НачДата И &КонДата
		| И РасчетыСКлиентами.ХозяйственнаяОперация = Значение(Перечисление.ХозяйственныеОперации.ПоступлениеОплатыОтКлиента)
		|" + ?(ЗначениеЗаполнено(ТекстУсловия), " И " ,"") + ТекстУсловия + СтрЗаменить(УсловиеПоНоменклатуреПартнерам, "ГДЕ", " И") + "
		| Упорядочить ПО" + "
		|" + ТекстГруппировки + "
		|ИТОГИ
		|	СУММА(Сумма),
		|	КОЛИЧЕСТВО(Различные Партнер)
		|ПО" + ТекстИтоги + "
		|АВТОУПОРЯДОЧИВАНИЕ";
	КонецЕсли;
    Запрос.УстановитьПараметр("НачДата", НачДата);
	Запрос.УстановитьПараметр("КонДата", КонецДня(КонДата));
	
	Результат = Запрос.Выполнить();

	Выборка = Результат.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);

	ДобавитьВеткуВДеревоДанныхНаСервере(Выборка, СтрокаИтого.Строки);
	
	КолвоЗаПериод = 0;
	СуммаЗаПериод = 0;
	СуммаИтого = 0;
	Для каждого ЭлементСуммКолонка Из СЗ_СуммируемыеПоляПриЗаполнении Цикл
		ИмяКолонки = ЭлементСуммКолонка.Значение;
		СтрокаИтого[ИмяКолонки] = СтрокаИтого.Строки.Итог(ИмяКолонки);
		
		Если Найти(ИмяКолонки, "Сумма") > 0 И Найти(ИмяКолонки, "НачПериода") = 0 Тогда
			СуммаИтого = СуммаИтого + СтрокаИтого[ИмяКолонки];
			СуммаЗаПериод = СуммаЗаПериод + СтрокаИтого[ИмяКолонки];
		ИначеЕсли Найти(ИмяКолонки, "Сумма") > 0 И Найти(ИмяКолонки, "НачПериода") > 0 Тогда
			СтрокаИтого[ИмяКолонки] = СуммаЗаПериод;
			СуммаЗаПериод = 0;
		ИначеЕсли Найти(ИмяКолонки, "Колво") > 0 И Найти(ИмяКолонки, "НачПериода") = 0 Тогда
			КолвоЗаПериод = КолвоЗаПериод + СтрокаИтого[ИмяКолонки];
		ИначеЕсли Найти(ИмяКолонки, "Колво") > 0 И Найти(ИмяКолонки, "НачПериода") > 0 Тогда
			СтрокаИтого[ИмяКолонки] = КолвоЗаПериод;
			КолвоЗаПериод = 0;
		КонецЕсли;
		
		Если СтрокаИтого[ИмяКолонки] = 0 Тогда
			ДеревоДанных.Колонки.Удалить(ДеревоДанных.Колонки.Индекс(ДеревоДанных.Колонки.Найти(ИмяКолонки)));
		КонецЕсли;	
	КонецЦикла;
	
	ТабличныйДокумент.Очистить();
	
	ОтчетОбъект = РеквизитФормыВЗначение("Отчет");
	Макет = ОтчетОбъект.ПолучитьМакет("Макет");
	ОблЗаголовок = Макет.ПолучитьОбласть("Заголовок");
	ОблШ_Параметр = Макет.ПолучитьОбласть("ШапкаТаблицы|Параметр");
	ОблШ_Период = Макет.ПолучитьОбласть("ШапкаТаблицы|Период");
	ОблШ_Среднее = Макет.ПолучитьОбласть("ШапкаТаблицы|СреднееЗаПериод");
	ОблШ_Всего = Макет.ПолучитьОбласть("ШапкаТаблицы|ВсегоЗаПериод");
	
	ОблЗаголовок.Параметры.Заголовок = "Отчет по " + ?(Показатель = "Отгрузка", " продажам (отгрузкам) клиентам", "оплате клиентов") + " за " + ПредставлениеПериода(НачДата, КонецДня(КонДата), "ФП=истина") + " (" + СокрЛП(Валюта) + ")"; 
	ТабличныйДокумент.Вывести(ОблЗаголовок);
	
	ОблШ_Параметр.Параметры.СтрПараметры = ТекстГруппировки;
	ТабличныйДокумент.Вывести(ОблШ_Параметр);
	
	Для каждого Колонка Из ДеревоДанных.Колонки Цикл
		
		Если Найти(Колонка.Имя, "НачПериодаКолво") > 0 Тогда
			//Дата = СтрЗаменить(Прав(Колонка.Имя, 10),"_",".");
			//Год = Число(Прав(Дата, 4));
			//Месяц = Число(Сред(Дата, 4, 2));
			//День = Число(Сред(Дата, 1, 2));
			//Дата = Дата(Год,Месяц,День);
			//Если Периодичность = "ПоДням" Тогда
			//	ОблШ_Среднее.Параметры.Период = "нед." + Формат(НачалоНедели(Дата), "ДФ=dd.MM.yyyy") + "-" + Формат(Мин(КонецНедели(Дата), КонДата), "ДФ=dd.MM.yyyy");
			//ИначеЕсли Периодичность = "ПоНеделям" Тогда
			//	ОблШ_Среднее.Параметры.Период = ПредставлениеПериода(НачалоМесяца(Дата), КонецМесяца(Дата), "ФП=истина");
			//ИначеЕсли Периодичность = "ПоМесяцам" Тогда
			//	ОблШ_Среднее.Параметры.Период = СокрЛП(Год) + " г.";
			//КонецЕсли;	
			ТабличныйДокумент.Присоединить(ОблШ_Среднее);
		ИначеЕсли Найти(Колонка.Имя, "Колво") > 0 Тогда	
			Дата = СтрЗаменить(Прав(Колонка.Имя, 10),"_",".");
			Год = Число(Прав(Дата, 4));
			Месяц = Число(Сред(Дата, 4, 2));
			День = Число(Сред(Дата, 1, 2));
			Дата = Дата(Год,Месяц,День);
			Если Периодичность = "ПоДням" Тогда
				ОблШ_Период.Параметры.Период = Формат(Дата, "ДФ=dd.MM.yyyy");
			ИначеЕсли Периодичность = "ПоНеделям" Тогда
				ОблШ_Период.Параметры.Период = "нед." + Формат(НачалоНедели(Дата), "ДФ=dd.MM.yyyy") + "-" + Формат(Мин(КонецНедели(Дата), КонДата), "ДФ=dd.MM.yyyy");
			ИначеЕсли Периодичность = "ПоМесяцам" Тогда
				ОблШ_Период.Параметры.Период = ПредставлениеПериода(НачалоМесяца(Дата), КонецМесяца(Дата), "ФП=истина");	
			КонецЕсли;
			ТабличныйДокумент.Присоединить(ОблШ_Период);
		КонецЕсли;	
			
	КонецЦикла;
	ТабличныйДокумент.Присоединить(ОблШ_Всего);		
	
	
	ТабличныйДокумент.НачатьАвтогруппировкуСтрок();
	Уровень = 0;
	
	ВывестиВТабличныйДокументНаСервере(СтрокаИтого.Строки, ДеревоДанных.Колонки, Уровень, СуммаИтого);
	ТабличныйДокумент.ЗакончитьАвтогруппировкуСтрок();
	
	ОблП_Параметр = Макет.ПолучитьОбласть("Подвал|Параметр");
	ОблП_Период = Макет.ПолучитьОбласть("Подвал|Период");
	ОблП_Среднее = Макет.ПолучитьОбласть("Подвал|СреднееЗаПериод");
	ОблП_Итого = Макет.ПолучитьОбласть("Подвал|ВсегоЗаПериод");
	
	ТабличныйДокумент.Вывести(ОблП_Параметр);
	
	КолвоПериодов = 0;
	КолвоЗаПериод = 0;
	ПериодовВсего = 0;
	
	СуммаСреднее = 0;
	Сумма = 0;
	КолвоСреднее = 0;
	Колво = 0;
	Для каждого Колонка Из ДеревоДанных.Колонки Цикл
		
		Если Найти(Колонка.Имя, "НачПериодаСумма") > 0 Тогда
			
			//ОблП_Среднее.Параметры.Колво = ДеревоДанных.Строки.Итог(Колонка.Имя);
			СуммаСреднее = СтрокаИтого[Колонка.Имя] / КолвоПериодов;
			
		ИначеЕсли Найти(Колонка.Имя, "НачПериодаКолво") > 0 Тогда
			
			//ОблП_Среднее.Параметры.Колво = ДеревоДанных.Строки.Итог(Колонка.Имя);
			ОблП_Среднее.Параметры.Среднее = СуммаСреднее;
			ОблП_Среднее.Параметры.КолвоСреднее = СтрокаИтого[Колонка.Имя] / КолвоПериодов;
			ТабличныйДокумент.Присоединить(ОблП_Среднее);
			КолвоПериодов = 0;
			
		ИначеЕсли Найти(Колонка.Имя, "Сумма") > 0 Тогда
			Сумма = СтрокаИтого[Колонка.Имя];
		ИначеЕсли Найти(Колонка.Имя, "Колво") > 0 Тогда	
			ОблП_Период.Параметры.Сумма = Сумма;
			ОблП_Период.Параметры.Колво = СтрокаИтого[Колонка.Имя];
			ТабличныйДокумент.Присоединить(ОблП_Период);
			КолвоПериодов = КолвоПериодов + 1;
			КолвоЗаПериод = КолвоЗаПериод + ОблП_Период.Параметры.Колво;
			ПериодовВсего = ПериодовВсего + 1;	
		КонецЕсли;	
	КонецЦикла;
		
	ОблП_Итого.Параметры.Колво = КолвоЗаПериод;
	ОблП_Итого.Параметры.Сумма = СуммаИтого;
	ОблП_Итого.Параметры.Среднее = СуммаИтого / ПериодовВсего;
	ОблП_Итого.Параметры.КолвоСреднее = КолвоЗаПериод / ПериодовВсего;
	
	ТабличныйДокумент.Присоединить(ОблП_Итого);
	
	ТабличныйДокумент.ФиксацияСверху = 4;
	ТабличныйДокумент.ФиксацияСлева = 1;
	
КонецПроцедуры//сформироватьНаСервере

///////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ НА КЛИЕНТЕ

&НаКлиенте
Процедура ДобавитьУдалитьГруппировкуСегменты() 
	
	Если Показатель = "Оплата" Тогда
		Строки = Группировки.НайтиСтроки(Новый Структура("Имя", "Сегменты"));
		Если Строки.Количество() > 0 Тогда
			Группировки.Удалить(Строки[0]);
		КонецЕсли;
		Элементы.ГруппаОтборНоменклатура.Видимость = Ложь;
		Элементы.ГруппаОтборСегменты.Видимость = Ложь;
	Иначе
		Строки = Группировки.НайтиСтроки(Новый Структура("Имя", "Сегменты"));
		Если Строки.Количество() = 0 Тогда
			СтрокаГруппировки = Группировки.Добавить();
			СтрокаГруппировки.Имя = "Сегменты";
			СтрокаГруппировки.ПутьОтгрузки = "ЕСТЬNULL(НоменклатураСегмента.Сегмент, ""<<вне сегмента>>"") КАК Сегмент,
											|РСв_АналитикаУчетаНоменклатуры.Номенклатура КАК Номенклатура,";
			СтрокаГруппировки.Представление = "Сегменты номенклатуры, номенклатура";
		КонецЕсли;
		Элементы.ГруппаОтборНоменклатура.Видимость = Истина;
		Элементы.ГруппаОтборСегменты.Видимость = Истина;
	КонецЕсли;
	
КонецПроцедуры//ДобавитьУдалитьГруппировкуСегменты()	

///////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	СтрокаГруппировки = Группировки.Добавить();
	СтрокаГруппировки.Имя = "Подразделение";
	
	СтрокаГруппировки.ПутьОплаты = "ЕстьNull(ОбъектыРасчетов.Менеджер,РСв_АналитикаУчетаПоПартнерам.Партнер.ОсновнойМенеджер) КАК Менеджер,";
	СтрокаГруппировки.ПутьОтгрузки = "ВыручкаИСебестоимостьПродажОбороты.Подразделение КАК Подразделение,";
	СтрокаГруппировки.Представление = "Подразделения";
	СтрокаГруппировки.Пометка = Истина;
	
	СтрокаГруппировки = Группировки.Добавить();
	СтрокаГруппировки.Имя = "Менеджер";
	СтрокаГруппировки.ПутьОплаты = "ЕстьNull(ОбъектыРасчетов.Менеджер,РСв_АналитикаУчетаПоПартнерам.Партнер.ОсновнойМенеджер) КАК Менеджер,";
	СтрокаГруппировки.ПутьОтгрузки = "ЕстьNull(ВыручкаИСебестоимостьПродажОбороты.ЗаказКлиента.Менеджер, РСв_АналитикаУчетаПоПартнерам.Партнер.ОсновнойМенеджер) КАК Менеджер,";
	СтрокаГруппировки.Представление = "Менеджеры";
	
	СтрокаГруппировки = Группировки.Добавить();
	СтрокаГруппировки.Имя = "ВидДеятельности";
	СтрокаГруппировки.ПутьОплаты = "ЕСТЬNULL(ПартнерыДополнительныеРеквизиты.Значение, ""<<вид деят-ти не указан>>"") КАК ВидДеятельности,";
	СтрокаГруппировки.ПутьОтгрузки = "ЕСТЬNULL(ПартнерыДополнительныеРеквизиты.Значение, ""<<вид деят-ти не указан>>"") КАК ВидДеятельности,";
	СтрокаГруппировки.Представление = "Виды деят-ти";
	
	СтрокаГруппировки = Группировки.Добавить();
	СтрокаГруппировки.Имя = "БизнесРегион";
	СтрокаГруппировки.ПутьОплаты = "ВЫБОР КОГДА ЕстьNull(ОбъектыРасчетов.Партнер.БизнесРегион, РСв_АналитикаУчетаПоПартнерам.Партнер.БизнесРегион) = ЗНАЧЕНИЕ(Справочник.БизнесРегионы.ПустаяСсылка) ТОГДА ""<<регион не указан>>"" ИНАЧЕ ЕстьNull(ОбъектыРасчетов.Партнер.БизнесРегион, РСв_АналитикаУчетаПоПартнерам.Партнер.БизнесРегион) Конец КАК БизнесРегион,";
	
	СтрокаГруппировки.ПутьОтгрузки = "Выбор когда ЕстьNull(ВыручкаИСебестоимостьПродажОбороты.ЗаказКлиента.Партнер.БизнесРегион, РСв_АналитикаУчетаПоПартнерам.Партнер.БизнесРегион) = Значение(Справочник.БизнесРегионы.ПустаяСсылка) Тогда ""<<регион не указан>>"" Иначе ЕстьNull(ВыручкаИСебестоимостьПродажОбороты.ЗаказКлиента.Партнер.БизнесРегион, РСв_АналитикаУчетаПоПартнерам.Партнер.БизнесРегион) Конец КАК БизнесРегион,";
	СтрокаГруппировки.Представление = "Бизнес-регионы";
	
	СтрокаГруппировки = Группировки.Добавить();
	СтрокаГруппировки.Имя = "Реклама";
	СтрокаГруппировки.ПутьОтгрузки = "";
	СтрокаГруппировки.Представление = "Реклама";
	СтрокаГруппировки.Пометка = Истина;
	
	ВидОтбораМенеджеры = "НеИспользоватьОтбор";
	ВидОтбораПодразделения = "НеИспользоватьОтбор";
	
	Периодичность = "ПоДням";
	
	Показатель = "Оплата";
	
	Валюта = Константы.ВалютаРегламентированногоУчета.Получить();
	
	ВидОтбораНоменклатура = "НеИспользоватьОтбор";
	ВидОтбораСегменты = "НеИспользоватьОтбор";
	
	ВидОтбораПартнеры = "НеВСписке";
	ОтборПартнеры.Очистить();
	
	Промсвязь = Справочники.Партнеры.НайтиПоНаименованию("Промсвязь");
	Если Промсвязь <> Неопределено Тогда
		ОтборПартнеры.Добавить(Промсвязь);
	КонецЕсли;
	
	Горторгснаб_Спб = Справочники.Партнеры.НайтиПоНаименованию("Горторгснаб Спб");
	Если Горторгснаб_Спб <> Неопределено Тогда
		ОтборПартнеры.Добавить(Горторгснаб_Спб);
	КонецЕсли;
	
КонецПроцедуры//ПриСозданииНаСервере

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ДобавитьУдалитьГруппировкуСегменты();
КонецПроцедуры

///////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ КОМАНД

&НаКлиенте
Процедура ПоказатьСкрытьПараметры(Команда)
	Элементы.ГруппаПараметры.Видимость = НЕ Элементы.ГруппаПараметры.Видимость;
КонецПроцедуры

&НаКлиенте
Процедура Сформировать(Команда)
	СформироватьНаСервере();
	Элементы.ГруппаГлавная.ТекущаяСтраница = Элементы.ГруппаГлавная.ПодчиненныеЭлементы.Результат;
КонецПроцедуры

&НаКлиенте
Процедура ПоказательПриИзменении(Элемент)
	ДобавитьУдалитьГруппировкуСегменты();
КонецПроцедуры


&НаСервере
Процедура ПриСохраненииПользовательскихНастроекНаСервере(Настройки)
	ВариантыОтчетов.ПриСохраненииПользовательскихНастроекНаСервере(ЭтотОбъект, Настройки);
КонецПроцедуры
